--[[
 ** 호랑이의 보은 **
 
 한 사람이 나무를 하러 산속에 들어갔다. 그런데 호랑이가 입을 벌리고 앉아서 옴짝도 못하게 길을 막았으나
 그 사람은 무서워하지 않았다.
 사람이 호랑이의 입속에 있는 것을 꺼내어 주겠다고 하자 호랑이가 고개를 끄덕거렸다.
 그는 호랑이의 입속에 손을 넣어 목에 걸린 비녀를 꺼내 주었다.
 사람을 잡아먹는 호랑이이지만 은혜를 알고 고마워하며 눈물을 흘리고 갔다.
 그 사람은 산중에서 홀로된 어머니를 모시며 가난하게 사는 노총각이었는데,
 어느 날 밤에 ‘쿵’ 소리가 나서 밖에 나가 보니 호랑이가 나무를 태산같이 해서 갖다 놓고 갔다.
 그 후로 호랑이 덕에 힘들게 나무하지 않고도 나무를 때며 살았다.
 또 어느 날 ‘쿵’ 소리가 나서 밖을 내다보니 이번에는 호랑이가 예쁜 처녀를 업어다 놨다.
 그 처녀는 어느 재상의 딸로 호랑이한테 물려와 정신을 잃었는데,
 정신을 차리고 보니 깊은 산중이라 집을 찾기가 어려웠다.
 처녀는 자기가 처한 상황에 어떤 이유가 있음을 짐작하고 그 총각과 혼인하고 살았다.
 두 사람은 호랑이가 늘 도와줘서 어머니를 모시며 아들을 낳고 잘 살고 있는데,
 어느 날 호랑이가 와서 자신이 죽을 날이 다 되었음을 알렸다.
 그리고 남자에게 장안에 가서 작패를 할 것이라며 그때 자신을 잡으라고 했다.
 이윽고 호랑이가 장안에 나타나 포악한 짓으로 사람들을 공포에 떨게 하니,
 호랑이를 잡아오면 벼슬과 상금을 준다는 포고가 내려졌다.
 그래서 남자는 장안에 가서 호랑이를 총으로 쏴 죽이고 벼슬과 상금을 받아 부자가 되었다.
--]]
